tutorials/cht-cem-coupling-flipped/fluid-openfoam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 1 0.0)
    (5 1 0.0)
    (5 2 0.0)
    (0 2 0.0)

    (0 1 0.1)
    (5 1 0.1)
    (5 2 0.1)
    (0 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 1) simpleGrading (1 1 1)
);

boundary
(

    in
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    out
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 0 4 5)
        );
    }

    frontback
    {
        type empty;
        faces
        (
            (1 2 3 0)
	    (5 6 7 4)
        );
    }

);
