tutorials/cht-cem-coupling-flipped/fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.5 0 0 );

boundaryField
{
    in
    {
        type            fixedValue;
	value		uniform (0.5 0 0);
    }
    out
    {
	type		zeroGradient;
    }
    top
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    frontback
    {
        type            empty;
    }
}
