tutorials/cht-cem-coupling-flipped/fluid-openfoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    in
    {
        type            fixedValue;
	value		uniform 300;
    }
    out
    {
	type		zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
	value		uniform 310; //$internalField
    }
    frontback
    {
        type            empty;
    }
}

